n = int(input("Сколько слов вы введете? "))
result = ""
for i in range(n):
    a = input("Введите слово ")
    result = result + a + " "

    print(result)

